Reports/СтатистикаЛиг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>СтатистикаЛиг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Лига</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лига</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ТурнирнаяТаблица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ТурнирнаяТаблица</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоГолов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОчков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Матч.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Матч</Name>
			<BasedOn>
				<xr:Item>Catalog.Стадионы</xr:Item>
				<xr:Item>Catalog.Команды</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТурнирнаяТаблица</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стадионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗрителей</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗрителей</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГолов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пенальти</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставыКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Игрок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Туры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Туры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОлимпийскаяСистема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/СтатистикаЛиг/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция Цвет(Команда)
	Возврат СерверныйФункции.ЦветКоманды(Команда);
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеПолучить(Лига, ТипГрафика, Команда)
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 11
	      	               |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
	      	               |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка
	      	               |ПОМЕСТИТЬ Чемпионаты
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Тур.Владелец.Владелец = &Лига
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	ТурнирнаяТаблица.Тур.Владелец,
	      	               |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
	      	               |
	      	               |ИМЕЮЩИЕ
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= 0.62 * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда) * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда)
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	МАКСИМУМ(ТурнирнаяТаблица.Период) УБЫВ
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	ТурнирнаяТаблица.Тур КАК Тур,
	      	               |	Чемпионаты.Чемпионат КАК Чемпионат,
	      	               |	Чемпионаты.Точка КАК Точка
	      	               |ПОМЕСТИТЬ Туры
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	      	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Чемпионаты КАК Чемпионаты
	      	               |			ПО Туры.Владелец = Чемпионаты.Чемпионат
	      	               |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	      	               |ГДЕ
	      	               |	Туры.ОлимпийскаяСистема = ЛОЖЬ" + ";
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
						   |");
	Если ТипГрафика = 0 Или ТипГрафика = 12 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 1 Или ТипГрафика = 13 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 2 Или ТипГрафика = 14 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.КоличествоГолов >= 3
		                              |	И ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 3 Или ТипГрафика = 15 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.КоличествоГолов <= 2
		                              |	И ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 4 Или ТипГрафика = 16 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	Противники.КоличествоГолов = 0
		                              |	И ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 5 Или ТипГрафика = 17 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.КоличествоОчков = Противники.КоличествоОчков
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 6 Или ТипГрафика = 18 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.КоличествоОчков = 0
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 7 И ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
		                              |	СУММА(Противники.КоличествоГолов) КАК КоличествоПропущено
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Команда = &Команда
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 7 Или ТипГрафика = 19 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 8 Или ТипГрафика = 20 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(Противники.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 9 Или ТипГрафика = 21 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.КоличествоГолов >= 3
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 10 Или ТипГрафика = 22 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	Противники.КоличествоГолов = 0
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 11 И ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов - Противники.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 11 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов - Противники.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |ИМЕЮЩИЕ
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов - Противники.КоличествоГолов) > 0
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 23 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(Противники.КоличествоГолов - ТурнирнаяТаблица.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |ИМЕЮЩИЕ
		                              |	СУММА(Противники.КоличествоГолов - ТурнирнаяТаблица.КоличествоГолов) > 0
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 24 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК Количество,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА Противники.КоличествоОчков = 0
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК Выигрыш,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противники.КоличествоОчков
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК Ничья,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 0
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК Проигрыш,
		                              |	ЕСТЬNULL(СУММА(Противники.КоличествоГолов), 0) КАК КоличествоПропущено
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов) - ЕСТЬNULL(СУММА(Противники.КоличествоГолов), 0) УБЫВ,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов) УБЫВ,
		                              |	Выигрыш УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 25 И ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.НомерСтроки = 1
		                              |				ТОГДА ТурнирнаяТаблица.КоличествоГолов
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.НомерСтроки = 1
		                              |				ТОГДА 0
		                              |			ИНАЧЕ ТурнирнаяТаблица.КоличествоГолов
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Команда = &Команда
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 25 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.НомерСтроки = 1
		                              |				ТОГДА ТурнирнаяТаблица.КоличествоГолов
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.НомерСтроки = 1
		                              |				ТОГДА 0
		                              |			ИНАЧЕ ТурнирнаяТаблица.КоличествоГолов
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 26 И ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противники.КоличествоОчков
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК Количество,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков < Противники.КоличествоОчков
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Команда = &Команда
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 26 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противники.КоличествоОчков
		                              |				ТОГДА 0
		                              |			ИНАЧЕ 1
		                              |		КОНЕЦ) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противники.КоличествоОчков
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.НомерСтроки = 1
		                              |	И Противники.НомерСтроки = 2
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 27 И ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоГолов + Противники.КоличествоГолов >= 3
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоГолов + Противники.КоличествоГолов >= 3
		                              |				ТОГДА 0
		                              |			ИНАЧЕ 1
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Команда = &Команда
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 27 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоГолов + Противники.КоличествоГолов >= 3
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоГолов + Противники.КоличествоГолов >= 3
		                              |				ТОГДА 0
		                              |			ИНАЧЕ 1
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.НомерСтроки = 1
		                              |	И Противники.НомерСтроки = 2
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 28 И ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(Матч.КоличествоЗрителей) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА Матч.Стадион.КоличествоЗрителей ЕСТЬ NULL
		                              |				ТОГДА ЕСТЬNULL(Стадионы.КоличествоЗрителей, 0)
		                              |			КОГДА Матч.Стадион.КоличествоЗрителей > Матч.КоличествоЗрителей
		                              |				ТОГДА Матч.Стадион.КоличествоЗрителей - Матч.КоличествоЗрителей
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	Документ.Матч КАК Матч
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Стадионы КАК Стадионы
		                              |			ПО ТурнирнаяТаблица.Команда = Стадионы.Владелец
		                              |		ПО Матч.Ссылка = ТурнирнаяТаблица.Регистратор
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО Матч.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Команда = &Команда
		                              |	И ТурнирнаяТаблица.НомерСтроки = 1
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 28 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(Матч.КоличествоЗрителей) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА Матч.Стадион.КоличествоЗрителей ЕСТЬ NULL
		                              |				ТОГДА ЕСТЬNULL(Стадионы.КоличествоЗрителей, 0)
		                              |			КОГДА Матч.Стадион.КоличествоЗрителей > Матч.КоличествоЗрителей
		                              |				ТОГДА Матч.Стадион.КоличествоЗрителей - Матч.КоличествоЗрителей
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	Документ.Матч КАК Матч
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Стадионы КАК Стадионы
		                              |			ПО ТурнирнаяТаблица.Команда = Стадионы.Владелец
		                              |		ПО Матч.Ссылка = ТурнирнаяТаблица.Регистратор
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО Матч.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.НомерСтроки = 1
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	КонецЕсли;
	Если ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "11", "21");
	ИначеЕсли ТипГрафика >= 23 Тогда
		//
	ИначеЕсли ТипГрафика >= 12 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Количество УБЫВ", "Количество");
	КонецЕсли;
	Запрос.УстановитьПараметр("Лига",			Лига);
	Запрос.УстановитьПараметр("Команда",		Команда);
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
КонецФункции

&НаСервере
Процедура ГрафикОбновить()
	Отчет.Данные.Очистить();
	График.Очистить();
	Если НЕ ЗначениеЗаполнено(Отчет.Лига) Тогда Возврат; КонецЕсли;
	
	График.ВидПодписей	= ВидПодписейКДиаграмме.Нет;
	График.ОбластьЗаголовка.Текст = ?(Разделить("18 20 23 24").Найти(ФорматЧГ(ТипГрафика)) = Неопределено, "", "Меньше - лучше");
	График.ОбластьЛегенды.Расположение = ?(ЗначениеЗаполнено(Отчет.Команда) И СтрНайти("0,2,3,4,9,10,11", ТипГрафика) > 0, РасположениеЛегендыДиаграммы.Нет, РасположениеЛегендыДиаграммы.Авто);
	Если ТипГрафика >= 25 Тогда
		График.ТипДиаграммы	= ТипДиаграммы.ГистограммаСНакоплением;
		График.ОбластьПостроения.ШкалаЗначений.ШагШкалы = ?(ТипГрафика = 25, 50, ?(ТипГрафика = 26 Или ТипГрафика = 27, 20, 0));
		График.ВидПодписей	= ВидПодписейКДиаграмме.Процент;
	ИначеЕсли ЗначениеЗаполнено(Отчет.Команда)
	И ТипГрафика = 7
	Тогда
		График.ТипДиаграммы	= ТипДиаграммы.ГистограммаСНакоплением;
		График.ОбластьПостроения.ШкалаЗначений.ШагШкалы = 10;
		График.ВидПодписей	= ВидПодписейКДиаграмме.Процент;
	Иначе
		График.ТипДиаграммы	= ТипДиаграммы.Гистограмма;
		График.ОбластьПостроения.ШкалаЗначений.ШагШкалы = ?(СтрНайти("0,7,8,11,12,19,20,23", ТипГрафика) > 0, 10, 2);
	КонецЕсли;
	
	Чемпионаты	= ДанныеПолучить(Отчет.Лига, ТипГрафика, Отчет.Команда);
	Максимально	= 0;
	Если Чемпионаты.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли ТипГрафика >= 25 Тогда
		Если ТипГрафика = 25 Тогда
			Хозяева	= График.УстановитьСерию("Хозяева");
			Гости	= График.УстановитьСерию("Гости");
		ИначеЕсли ТипГрафика = 26 И ЗначениеЗаполнено(Отчет.Команда) Тогда
			СерверныйФункции.СерииЗаполнить(График);
		ИначеЕсли ТипГрафика = 26 Тогда
			Хозяева	= График.УстановитьСерию("Ничья");
			Гости	= График.УстановитьСерию("Победа");
		ИначеЕсли ТипГрафика = 27 Тогда
			Хозяева	= График.УстановитьСерию("ТБ 2.5");
			Гости	= График.УстановитьСерию("ТМ 2.5");
		Иначе
			Хозяева	= График.УстановитьСерию("Зрители");
			Гости	= График.УстановитьСерию("Пусто");
		КонецЕсли;
		Пока Чемпионаты.Следующий() Цикл
			Точка = График.УстановитьТочку(ФорматЧГ(Чемпионаты.Точка));
			Точка.Расшифровка = Чемпионаты.Чемпионат;
			Если ТипГрафика = 26 И ЗначениеЗаполнено(Отчет.Команда) Тогда
				График.УстановитьЗначение(Точка, 0, Чемпионаты.КоличествоПропущено);
				График.УстановитьЗначение(Точка, 1, Чемпионаты.Количество);
				График.УстановитьЗначение(Точка, 2, Чемпионаты.КоличествоЗабито);
				
				Максимально = Макс(Максимально, Чемпионаты.КоличествоЗабито + Чемпионаты.КоличествоПропущено + Чемпионаты.Количество);
			Иначе
				График.УстановитьЗначение(Точка, Хозяева, Чемпионаты.КоличествоЗабито);
				График.УстановитьЗначение(Точка, Гости, Чемпионаты.КоличествоПропущено);
				
				Максимально = Макс(Максимально, Чемпионаты.КоличествоЗабито + Чемпионаты.КоличествоПропущено);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ЗначениеЗаполнено(Отчет.Команда)
	И ТипГрафика = 7
	Тогда
		СерверныйФункции.СерииЗаполнить(График, Истина);
		Пока Чемпионаты.Следующий() Цикл
			Точка = График.УстановитьТочку(ФорматЧГ(Чемпионаты.Точка));
			Точка.Расшифровка = Чемпионаты.Чемпионат;
			График.УстановитьЗначение(Точка, 0, Чемпионаты.КоличествоЗабито);
			График.УстановитьЗначение(Точка, 1, Чемпионаты.КоличествоПропущено);
			
			Максимально = Макс(Максимально, Чемпионаты.КоличествоЗабито + Чемпионаты.КоличествоПропущено);
		КонецЦикла;
		
	Иначе
		Значения	= Новый Массив;
		Точки		= Новый Соответствие;
		Серии		= Новый Соответствие;
		
		Если ЗначениеЗаполнено(Отчет.Команда) Тогда
			ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Новый Структура("Серия", Отчет.Команда));
			Пока Чемпионаты.Следующий() Цикл
				Точка = График.УстановитьТочку(ФорматЧГ(Чемпионаты.Точка));
				Точка.Расшифровка = Чемпионаты.Чемпионат;
				
				Точки.Вставить(Чемпионаты.Чемпионат, Точка);
			КонецЦикла;
		Иначе
			ЗначениеК	= ?(ТипГрафика <= 11 Или ТипГрафика = 23 Или ТипГрафика = 24, 2, 1);
			Пока Чемпионаты.Следующий() Цикл
				Значения.Очистить();
				Количество	= 0;
				
				Выборка	= Чемпионаты.Выбрать();
				Пока Выборка.Следующий() И Значения.Количество() < ЗначениеК Или Выборка.Количество = Количество Цикл
					Значения.Добавить(Выборка.Количество);
					Количество = Выборка.Количество;
					
					Если Отчет.Данные.НайтиСтроки(Новый Структура("Серия", Выборка.Серия)).Количество() = 0 Тогда
						ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Выборка);
					КонецЕсли;
					Точка	= Точки.Получить(Выборка.Чемпионат);
					Если Точка = Неопределено Тогда
						Точка = График.УстановитьТочку(ФорматЧГ(Выборка.Точка));
						Точка.Расшифровка = Выборка.Чемпионат;
						
						Точки.Вставить(Выборка.Чемпионат, Точка);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			Отчет.Данные.Сортировать("Серия");
		КонецЕсли;
		Чемпионаты.Сбросить();
		Для Каждого ТекСтрока Из Отчет.Данные Цикл
			Серия = График.УстановитьСерию(ТекСтрока.Серия);
			Цвет	= Цвет(ТекСтрока.Серия);
			Если ЗначениеЗаполнено(Цвет) Тогда
				Серия.Цвет				= Цвет;
				Серия.ПриоритетЦвета	= Истина;
			КонецЕсли;
			Серия.Расшифровка	= ТекСтрока.Серия;
			
			Серии.Вставить(ТекСтрока.Серия, Серия);
		КонецЦикла;
		
		Пока Чемпионаты.Следующий() Цикл
			Количество	= 0;
			Выборка	= Чемпионаты.Выбрать();
			Пока Выборка.Следующий() Цикл
				Количество	= Количество + 1;
				Серия	= Серии.Получить(Выборка.Серия);
				Если Серия = Неопределено Тогда Продолжить; КонецЕсли;
				
				График.УстановитьЗначение(Точки.Получить(Выборка.Чемпионат), Серия, ?(ТипГрафика = 24, Количество, Выборка.Количество));
				
				Максимально = Макс(Максимально, ?(ТипГрафика = 24, Количество, Выборка.Количество));
				
				Если ЗначениеЗаполнено(Отчет.Команда) Тогда Прервать; КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	График.ОсьЗначений.МаксимальноеЗначение = ?(Максимально <= 40, Максимально, ?(ТипГрафика = 28, Окр(Максимально + 500, -3), Окр(Максимально + 5, -1)));
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		ГрафикОбновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ТипГрафикаЗагрузить()
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		Если Элементы.ТипГрафика.СписокВыбора.НайтиПоЗначению(23) <> Неопределено
		Или Элементы.ТипГрафика.СписокВыбора.Количество() = 0
		Тогда
			Элементы.ТипГрафика.СписокВыбора.Очистить();
			Элементы.ТипГрафика.СписокВыбора.Добавить(0, "Количество очков");
			Элементы.ТипГрафика.СписокВыбора.Добавить(2, "Количество 'верховых' побед");
			Элементы.ТипГрафика.СписокВыбора.Добавить(3, "Количество 'низовых' побед");
			Элементы.ТипГрафика.СписокВыбора.Добавить(4, "Количество 'сухих' побед");
			
			Элементы.ТипГрафика.СписокВыбора.Добавить(7, "Количество голов забито | пропущено");
			
			Элементы.ТипГрафика.СписокВыбора.Добавить(9, "Количество 'верховых' матчей");
			Элементы.ТипГрафика.СписокВыбора.Добавить(10, "Количество 'сухих' матчей");
			Элементы.ТипГрафика.СписокВыбора.Добавить(11, "Разница голов");
			
			Элементы.ТипГрафика.СписокВыбора.Добавить(24, "Место в турнирной таблице");
			Элементы.ТипГрафика.СписокВыбора.Добавить(25, "Количество голов дома | выезд");
			Элементы.ТипГрафика.СписокВыбора.Добавить(26, "Количество побед | ничьих | проигрышей");
			Элементы.ТипГрафика.СписокВыбора.Добавить(27, "Количество 'верховых | низовых' матчей");
			Элементы.ТипГрафика.СписокВыбора.Добавить(28, "Посещаемость");
		КонецЕсли;
	ИначеЕсли Элементы.ТипГрафика.СписокВыбора.НайтиПоЗначению(23) = Неопределено Тогда
		Элементы.ТипГрафика.СписокВыбора.Очистить();
		Элементы.ТипГрафика.СписокВыбора.Добавить(0, "Максимальное количество очков");
		Элементы.ТипГрафика.СписокВыбора.Добавить(1, "Максимальное количество побед");
		Элементы.ТипГрафика.СписокВыбора.Добавить(2, "Максимальное количество 'верховых' побед");
		Элементы.ТипГрафика.СписокВыбора.Добавить(3, "Максимальное количество 'низовых' побед");
		Элементы.ТипГрафика.СписокВыбора.Добавить(4, "Максимальное количество 'сухих' побед");
		Элементы.ТипГрафика.СписокВыбора.Добавить(5, "Максимальное количество ничьих");
		Элементы.ТипГрафика.СписокВыбора.Добавить(6, "Максимальное количество проигрышей");
		Элементы.ТипГрафика.СписокВыбора.Добавить(7, "Максимальное количество голов (забито)");
		Элементы.ТипГрафика.СписокВыбора.Добавить(8, "Максимальное количество голов (пропущено)");
		Элементы.ТипГрафика.СписокВыбора.Добавить(9, "Максимальное количество 'верховых' матчей");
		Элементы.ТипГрафика.СписокВыбора.Добавить(10, "Максимальное количество 'сухих' матчей");
		Элементы.ТипГрафика.СписокВыбора.Добавить(11, "Лучшая разница голов");
		Элементы.ТипГрафика.СписокВыбора.Добавить(12, "Минимальное количество очков");
		Элементы.ТипГрафика.СписокВыбора.Добавить(13, "Минимальное количество побед");
		Элементы.ТипГрафика.СписокВыбора.Добавить(14, "Минимальное количество 'верховых' побед");
		Элементы.ТипГрафика.СписокВыбора.Добавить(15, "Максимальное количество 'низовых' побед");
		Элементы.ТипГрафика.СписокВыбора.Добавить(16, "Максимальное количество 'сухих' побед");
		Элементы.ТипГрафика.СписокВыбора.Добавить(17, "Минимальное количество ничьих");
		Элементы.ТипГрафика.СписокВыбора.Добавить(18, "Минимальное количество проигрышей");
		Элементы.ТипГрафика.СписокВыбора.Добавить(19, "Минимальное количество голов (забито)");
		Элементы.ТипГрафика.СписокВыбора.Добавить(20, "Минимальное количество голов (пропущено)");
		Элементы.ТипГрафика.СписокВыбора.Добавить(21, "Минимальное количество 'верховых' матчей");
		Элементы.ТипГрафика.СписокВыбора.Добавить(22, "Минимальное количество 'сухих' матчей");
		Элементы.ТипГрафика.СписокВыбора.Добавить(23, "Худшая разница голов");
		Элементы.ТипГрафика.СписокВыбора.Добавить(24, "Место в турнирной таблице");
		Элементы.ТипГрафика.СписокВыбора.Добавить(25, "Количество голов дома | выезд");
		Элементы.ТипГрафика.СписокВыбора.Добавить(26, "Количество побед | ничьих");
		Элементы.ТипГрафика.СписокВыбора.Добавить(27, "Количество 'верховых | низовых' матчей");
		Элементы.ТипГрафика.СписокВыбора.Добавить(28, "Посещаемость");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Лига") Тогда
		Отчет.Лига	= Параметры.Лига;
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Лига);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Отчет.Лига) Тогда
		Отчет.Лига = МояЛига();
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.Лига) Тогда
		КомандыЗагрузить();
	КонецЕсли;
	ТипГрафикаЗагрузить();
	Сформировать();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Чемпионаты") Тогда
		СтандартнаяОбработка = Ложь;
		
		Форма = ПолучитьФорму("Отчет.ТурнирнаяТаблица.Форма");
		Форма.АвтоматическоеСохранениеДанныхВНастройках = АвтоматическоеСохранениеДанныхФормыВНастройках.НеИспользовать;
		Форма.Отчет.Чемпионат = Расшифровка;
		Если Форма.Открыта() Тогда
			Форма.КомандаСформировать();
		КонецЕсли;
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояЛига()
	Возврат СерверныйФункции.Лига(СерверныйФункции.ЧемпионатПолучитьПоследнее());
КонецФункции

&НаКлиенте
Процедура КомандаОчистка(Элемент, СтандартнаяОбработка)
	ТипГрафикаЗагрузить();
	ГрафикОбновить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция КомандыПолучить(Лига)
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 11
	      	               |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
	      	               |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка
	      	               |ПОМЕСТИТЬ Чемпионаты
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Тур.Владелец.Владелец = &Лига
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	ТурнирнаяТаблица.Тур.Владелец,
	      	               |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
	      	               |
	      	               |ИМЕЮЩИЕ
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= 0.62 * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда) * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда)
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	МАКСИМУМ(ТурнирнаяТаблица.Период) УБЫВ
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	ТурнирнаяТаблица.Тур КАК Тур,
	      	               |	Туры.Владелец КАК Чемпионат
	      	               |ПОМЕСТИТЬ Туры
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	      	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Чемпионаты КАК Чемпионаты
	      	               |			ПО Туры.Владелец = Чемпионаты.Чемпионат
	      	               |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	      	               |ГДЕ
	      	               |	Туры.ОлимпийскаяСистема = ЛОЖЬ
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ
	      	               |	ТурнирнаяТаблица.Команда КАК Команда
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
	      	               |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	ТурнирнаяТаблица.Команда
	      	               |
	      	               |ИМЕЮЩИЕ
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Туры.Чемпионат) > 3
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Команда
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Лига",			Лига);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаКлиенте
Процедура КомандаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;
	Если ЗначениеЗаполнено(Отчет.Лига) Тогда
		КомандыЗагрузить();
		ОткрытьФорму("Справочник.Команды.ФормаВыбора", Новый Структура("Отбор", Новый Структура("Ссылка", КомандыПолучить(Отчет.Лига))), Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандыЗагрузить()
	Если Клубы.Количество() = 0 Тогда
		Клубы.ЗагрузитьЗначения(КомандыПолучить(Отчет.Лига));
		Элементы.Команда.СписокВыбора.ЗагрузитьЗначения(Клубы.ВыгрузитьЗначения());
		ПодключитьОбработчикОжидания("КартинкиЗагрузить", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛигаПриИзменении(Элемент)
	Отчет.Команда = Неопределено;
	Клубы.Очистить();
	КомандыЗагрузить();
	ГрафикОбновить();
КонецПроцедуры

&НаКлиенте
Процедура КартинкиЗагрузить() Экспорт
	ОбщегоНазначения.КартинкиЗагрузить(Элементы.Команда.СписокВыбора, Кеш);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	ТипГрафикаЗагрузить();
	ГрафикОбновить();
КонецПроцедуры

&НаКлиенте
Процедура ТипГрафикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПодключитьОбработчикОжидания("ТипГрафикаЗагрузитьАсинх", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТипГрафикаЗагрузитьАсинх() Экспорт
	ТипГрафикаЗагрузить();
КонецПроцедуры
